<?php
  /***** Translations file *****/
  /*** Translations functions ***/
  function set($data, $check = false, $replace = false) {
    if($check) {
      if(!isset($data) || !$data) {
        return false;
      }
    }
    if($replace) {
      $data = $replace;
    }
    echo $data;
    return;
  };
  function setLink($data, $type) {
    switch($type) {
      case 'phone':
        echo 'tel:'.preg_replace('/\D/', '', $data);
        break;
      case 'email':
        echo 'mailto:'.trim($data);
        break;
      default:
        break;
    }
    return;
  }

  $config = [
    'email' => 'foundation@klimenko.com',
    'protocol' => isset($_SERVER['HTTPS']) ? "https://" : "http://",
    'domain' => $_SERVER['HTTP_HOST']
  ];

  /*** Microdata translations ***/
  $languages['microdata'] = [
    'logo' => [
      'ru' => $config['protocol'].$config['domain'].'/images/common/logo_ru.png',
      'uk' => $config['protocol'].$config['domain'].'/images/common/logo_uk.png',
    ],
    'google' => [
      'image' => [
        'ru' => $config['protocol'].$config['domain'].'/images/common/socials_ru.png',
        'uk' => $config['protocol'].$config['domain'].'/images/common/socials_uk.jpg'
      ],
    ],
    'facebook' => [
      'image' => [
        'ru' => $config['protocol'].$config['domain'].'/images/common/socials_ru.png',
        'uk' => $config['protocol'].$config['domain'].'/images/common/socials_uk.jpg'
      ],
      'type' => 'image/jpeg',
      'width' => 1200,
      'height' => 630
    ],
    'twitter' => [
      'creator' => '',
      'image' => [
        'ru' => $config['protocol'].$config['domain'].'/images/common/socials_ru.png',
        'uk' => $config['protocol'].$config['domain'].'/images/common/socials_uk.jpg'
      ],
    ]
  ];

  /*** Site translations ***/
  $languages['site'] = [
    'title' => [
      'ru' => 'Klymenko charity family foundation',
      'uk' => 'Klymenko charity family foundation',
    ],
    'description' => [
      'ru' => '',
      'uk' => '',
    ],
    'keywords' => [
      'ru' => '',
      'uk' => '',
    ]
  ];

  /*** Locales translations ***/
  $languages['locales'] = [
    'ru' => [
      'text' => 'Укр',
      'title' => 'Украинский язык',
      'href' => './uk',
      'locale' => 'ru'
    ],
    'uk' => [
      'text' => 'Рос',
      'title' => 'Російська мова',
      'href' => './ru',
      'locale' => 'uk'
    ]
  ];

  /*** Menu translations ***/
  $languages['menu'] = [
    'items' => [
      'kids' => [
        'ru' => 'Помощь детям',
        'uk' => 'Допомога дітям',
      ],
      'temples' => [
        'ru' => 'Пожертвования храмам',
        'uk' => 'Пожертва храмам',
      ],
      'founders' => [
        'ru' => 'Основатели',
        'uk' => 'Засновники',
      ]
    ],
  ];

  /*** Header translations ***/
  $languages['header'] = [
    'title' => [
      'ru' => 'Благотворительный фонд Klymenko charity family foundation',
      'uk' => 'Благодійний фонд Klymenko charity family foundation',
    ],
    'text' => [
      'ru' => 'Жить, чтобы побеждать, творить и&nbsp;созидать с&nbsp;именем Господа нашего Иисуса Христа, приумножая добро на&nbsp;Земле!',
      'uk' => "Жити, щоб&nbsp;перемагати і&nbsp;творити з&nbsp;ім'ям Господа нашого Ісуса Христа, примножуючи добро на&nbsp;Землі!",
    ],
  ];

  /*** Objects translations ***/
  $languages['kids'] = [
    'title' => [
      'ru' => 'Помощь детям',
      'uk' => 'Допомога дітям',
    ],
    'text' => [
      'ru' => 'В&nbsp;начале&nbsp;2000-х мы&nbsp;посетили детское отделение туберкулезной больницы. И&nbsp;ужаснулись. Ребята лечились там&nbsp;годами, спали на&nbsp;сбившихся в&nbsp;комки подушках и&nbsp;матрасах. В&nbsp;палатах было темно и&nbsp;сыро…',
      'uk' => 'На&nbsp;початку&nbsp;2000-х ми&nbsp;відвідали дитяче відділення туберкульозної лікарні. Це&nbsp;було сумне видовище. Діти лікувалися там&nbsp;роками, спали на&nbsp;старих подушках і&nbsp;матрацах. В&nbsp;палатах було темно й&nbsp;сиро…',
    ],
    'story' => [
      'ru' => 'Наша история',
      'uk' => 'Наша історія',
    ],
    'important' => [
      'ru' => 'Больше&nbsp;100',
      'uk' => 'Більше&nbsp;100',
    ],
    'description' => [
      'ru' => 'детей получили необходимую им&nbsp;медицинскую помощь с&nbsp;2000 по&nbsp;2017&nbsp;годы',
      'uk' => 'дітей отримали необхідну їм медичну допомогу з&nbsp;2000 по&nbsp;2017&nbsp;роки',
    ],
  ];

  /*** Objects translations ***/
  $languages['temples'] = [
    'title' => [
      'ru' => 'Пожертвования храмам',
      'uk' => 'Пожертва храмам',
    ],
    'text' => [
      'ru' => [
        'Наша помощь храмам и&nbsp;церквям началась с&nbsp;помощи священнику, которому не&nbsp;хватало средств, чтобы достроить храм. Потом мы&nbsp;помогли возвести колокольню, открыли трапезную и&nbsp;воскресную школу.',
         'В&nbsp;разное время мы&nbsp;помогли и&nbsp;продолжаем оказывать помощь всем епархиям Православной церкви в&nbsp;Украине.',
         'Из&nbsp;благотворительного фонда в&nbsp;Донецкой области мы&nbsp;выросли до&nbsp;всеукраинского, а&nbsp;затем и&nbsp;до&nbsp;международного, с&nbsp;представительствами в&nbsp;России и&nbsp;Европе.',
         'Мы&nbsp;благодарны каждому ребенку, семье, каждому храму за&nbsp;то, что&nbsp;приняли нашу помощь. И&nbsp;мы&nbsp;обязательно продолжим благотворительную деятельность с&nbsp;чувством созидания будущего и&nbsp;верой в&nbsp;Господа нашего Иисуса Христа.'
      ],
      'uk' => [
        'Наша допомога храмам і&nbsp;церквам розпочалася з&nbsp;допомоги священику, якому не&nbsp;вистачало коштів, щоб&nbsp;добудувати храм. Потім ми&nbsp;допомогли звести дзвіницю, відкрили трапезну і&nbsp;недільну школу.',
         'У&nbsp;різний&nbsp;час ми&nbsp;допомогли і&nbsp;продовжуємо надавати допомогу всім&nbsp;єпархіям Православної церкви в&nbsp;Україні.',
         'З&nbsp;благодійного фонду в&nbsp;Донецькій області ми&nbsp;виросли до&nbsp;всеукраїнського, а&nbsp;потім до&nbsp;міжнародного, з&nbsp;представництвами в&nbsp;Росії та&nbsp;Європі.',
         "Ми&nbsp;вдячні кожній дитині, родині, кожному храму за&nbsp;те, що&nbsp;прийняли нашу допомогу. І&nbsp;ми&nbsp;обов'язково продовжимо нашу благодійну діяльність з&nbsp;почуттям творення майбутнього і&nbsp;вірою в&nbsp;Господа нашого Ісуса Христа."
      ],
    ],
    'year' => [
      'ru' => 'год',
      'uk' => 'рік',
    ],
    'years' => [
      '2011' => [
        'ru' => 'Наш благотворительный фонд становится всеукраинским',
        'uk' => 'Наш благодійний фонд стає всеукраїнським',
      ],
      '2016' => [
        'ru' => 'Klymenko charity family foundation работает с&nbsp;международными проектами',
        'uk' => 'Klymenko charity family foundation працює з&nbsp;міжнародними проектами',
      ]
    ]
  ];

  /*** Objects translations ***/
  $languages['objects'] = [
    'title' => [
      'ru' => 'Храмы, которым мы&nbsp;помогаем',
      'uk' => 'Храми, яким ми&nbsp;допомагаємо',
    ],
    'items' => [
      '1' => [
        'title' => [
          'ru' => 'Свято-Успенская<br> Святогорская Лавра',
          'uk' => 'Свято-Успенська<br> Святогірська Лавра',
        ],
        'text' => [
          'ru' => 'Святогорская Лавра — значимый духовный центр для&nbsp;православной паствы восточной Украины. На&nbsp;сегодня отреставрирован Успенский собор, монастырская колокольня с&nbsp;Покровским храмом, древнейший храм обители со&nbsp;скитом в&nbsp;честь преподобных Антония и&nbsp;Феодосия Печерских. Восстановлен храм в&nbsp;честь преподобного Алексия, человека Божьего и&nbsp;Храм святителя Николая на&nbsp;верхушке меловой скалы.',
          'uk' => 'Святогірська Лавра — значний духовний центр для&nbsp;православної пастви східної України. На&nbsp;сьогодні відреставровано Успенський собор, монастирську дзвіницю з&nbsp;Покровським храмом, найдавніший храм обителі зі&nbsp;скитом на&nbsp;честь преподобних Антонія і&nbsp;Феодосія Печерських. Відновлено храм на&nbsp;честь преподобного Олексія, чоловіка Божого і&nbsp;Храм святителя Миколая на&nbsp;верхівці крейдяної скелі.',
        ],
      ],
      '2' => [
        'title' => [
          'ru' => 'Свято-Успенская<br> Киево-Печерская Лавра',
          'uk' => 'Свято-Успенська<br> Києво-Печерська Лавра',
        ],
        'text' => [
          'ru' => 'Киево-Печерская Лавра — древнейший монастырь в&nbsp;Украине. В&nbsp;её&nbsp;стенах работает возрождённая в&nbsp;1989&nbsp;году Киевская духовная семинария, а&nbsp;с&nbsp;1992&nbsp;года Киевская духовная академия. Братия монастыря регулярно совершает богослужения в&nbsp;Трапезном храме Преподобных Антония и&nbsp;Феодосия Печерских в&nbsp;главном храме обители — Успенском соборе.',
          'uk' => 'Києво-Печерська Лавра — найдавніший монастир в&nbsp;України. В&nbsp;її&nbsp;стінах працює відроджена в&nbsp;1989&nbsp;році Київська духовна семінарія, а&nbsp;з&nbsp;1992&nbsp;року —  Київська духовна академія. Братія монастиря регулярно здійснює богослужіння в&nbsp;Трапезному храмі Преподобних Антонія і&nbsp;Феодосія Печерських в&nbsp;головному храмі обителі — Успенському соборі.',
        ],
      ],
      '3' => [
        'title' => [
          'ru' => 'Кафедральный собор Богоявления Господнего',
          'uk' => 'Кафедральний собор Богоявлення Господнього',
        ],
        'text' => [
          'ru' => 'Православный кафедральный собор в&nbsp;Горловке. Первый камень был&nbsp;заложен 4&nbsp;июля 2007&nbsp;года. Собор освящён Блаженнейшим Владимиром, Митрополитом Киевским и&nbsp;всея Украины 18&nbsp;сентября 2013&nbsp;года.',
          'uk' => 'Православний кафедральний собор в&nbsp;Горлівці. Перший камінь був&nbsp;закладений 4&nbsp;липня 2007&nbsp;року. Собор освячений Блаженнішим Володимиром, Митрополитом Київським і&nbsp;всієї України 18&nbsp;вересня 2013&nbsp;року.',
        ],
      ],
      '4' => [
        'title' => [
          'ru' => 'Больше&nbsp;10 других соборов и&nbsp;храмов в&nbsp;Украине и&nbsp;за&nbsp;рубежом',
          'uk' => 'Більше&nbsp;10 інших соборів і&nbsp;храмів в&nbsp;Україні та&nbsp;за&nbsp;кордоном',
        ],
        'text' => [
          'ru' => 'Свято-Николаевский храм Киевской Епархии, Свято-Успенский Собор и&nbsp;Свято-Николаевский храм Днепропетровской епархии. Свято-Георгиевская община и&nbsp;Свято-Троицкий собор Донецкой епархии. Свято-Сергиевский женский монастырь Горловской епархии и&nbsp;другие.
',
          'uk' => 'Свято-Миколаївський храм Київської Єпархії, Свято-Успенський Собор і&nbsp;Свято-Миколаївський храм Дніпропетровської єпархії. Свято-Георгіївська громада і&nbsp;Свято-Троїцький собор Донецької єпархії. Свято-Сергієвський жіночий монастир Горлівської єпархії та&nbsp;інші.
',
        ],
      ],
    ]
  ];

  /*** Founders translations ***/
  $languages['founders'] = [
    'title' => [
      'ru' => 'Основатели фонда',
      'uk' => 'Засновники фонду',
    ],
    'text' => [
      'ru' => 'Этот сайт создан, чтобы вы&nbsp;могли найти&nbsp;нас, если вам&nbsp;понадобится помощь.<br>Мы&nbsp;не&nbsp;будем публиковать отчётов о&nbsp;проделанной работе и&nbsp;фотографии благодарных подопечных. Мы – православные христиане и&nbsp;помним евангельские слова «когда творишь милостыню, не&nbsp;труби перед собою… пусть левая рука твоя не&nbsp;знает, что&nbsp;делает правая, чтобы милостыня твоя была втайне; и&nbsp;Отец твой, видящий тайное, воздаст тебе явно» (Мф. 6:2–4).<br>Мы&nbsp;убеждены, что по-настоящему&nbsp;мир можно изменить только добром и&nbsp;любовью, которые стали стилем жизни. И&nbsp;мы&nbsp;стараемся сделать мир&nbsp;лучше.',
      'uk' => "Цей сайт створений, щоб&nbsp;ви&nbsp;змогли знайти нас, якщо&nbsp;вам знадобиться допомога.<br>Ми&nbsp;не&nbsp;будемо публікувати звітів про&nbsp;виконану роботу і&nbsp;фото вдячних підопічних. Ми — православні християни і&nbsp;пам'ятаємо біблейські слова: «коли твориш милостиню, не&nbsp;сурми перед собою ... нехай ліва рука твоя не&nbsp;знає, що&nbsp;робить права, щоб&nbsp;таємна була твоя милостиня; і&nbsp;Отець твій, що&nbsp;бачить таємне, віддасть тобі явно» (Мф. 6: 2–4).<br>Ми&nbsp;переконані, що&nbsp;по-справжньому світ можна змінити тільки добром і&nbsp;любов'ю, які&nbsp;стали стилем життя. І&nbsp;ми&nbsp;намагаємося зробити світ&nbsp;кращим.",
    ],
    'name' => [
      'ru' => 'Клименко<br> Антон Викторович',
      'uk' => 'Клименко<br> Антон Вікторович',
    ],
    'description' => [
      'ru' => 'Бизнесмен, политик,<br> венчурный инвестор,<br> филантроп',
      'uk' => 'Бізнесмен, політик,<br> венчурний інвестор,<br> філантроп ',
    ],
  ];

  /*** Modal translations ***/
  $languages['modal'] = [
    'text' => [
      'ru' => [
        'В&nbsp;начале&nbsp;2000-х мы&nbsp;посетили детское отделение туберкулезной больницы. И&nbsp;ужаснулись. Ребята лечились там&nbsp;годами, спали на&nbsp;сбившихся в&nbsp;комки подушках и&nbsp;матрасах. В&nbsp;палатах было темно и&nbsp;сыро. Не&nbsp;задумываясь мы&nbsp;организовали небольшой ремонт, купили новое постельные бельё и&nbsp;лампочки. Но&nbsp;детей это&nbsp;мало&nbsp;порадовало…',
         'Тогда работница больницы дала нам&nbsp;совет: «Одеяла и&nbsp;подушки – это&nbsp;хорошо, но&nbsp;детям нужен праздник!». Мы&nbsp;прислушались к&nbsp;её&nbsp;словам. Стали регулярно организовывать день именинника, со&nbsp;сладостями, воздушными шарами, конкурсами и&nbsp;подарками. Фотографии с&nbsp;этих замечательных дней рождений мы&nbsp;храним до&nbsp;сих&nbsp;пор. Так&nbsp;и&nbsp;началась наша благотворительная деятельность.',
         'Мы&nbsp;помогаем совсем маленьким детям до&nbsp;трёх&nbsp;лет — отказникам, часто тяжело больным. Ребятам постарше содействуем в&nbsp;преодолении серьезных недугов. Сегодня счёт таких детей идет уже&nbsp;на&nbsp;сотни.',
         'Наш&nbsp;фонд оказывает благотворительную помощь всем нуждающимся независимо от&nbsp;национальности, гражданства и&nbsp;социального положения.'
      ],
      'uk' => [
        'На&nbsp;початку&nbsp;2000-х ми&nbsp;відвідали дитяче відділення туберкульозної лікарні. Це&nbsp;було сумне видовище. Діти лікувалися там&nbsp;роками, спали на&nbsp;старих подушках і&nbsp;матрацах. В&nbsp;палатах було темно й&nbsp;сиро. Не&nbsp;замислюючись ми&nbsp;зробили невеликий ремонт, купили нову постільну білизну й&nbsp;лампочки. Але&nbsp;дітей це&nbsp;мало&nbsp;порадувало…',
         'Тоді працівниця лікарні дала нам&nbsp;пораду: «Ковдри і&nbsp;подушки — це&nbsp;добре, але&nbsp;ж&nbsp;дітям потрібне свято!». Ми&nbsp;прислухалися до&nbsp;її&nbsp;слів. Стали організовувати день іменинника з&nbsp;солодощами, повітряними кульками, конкурсами і&nbsp;подарунками. Фотографії з&nbsp;тих чудових днів народжень зберігаємо й&nbsp;досі. Так&nbsp;і&nbsp;почалася наша благодійна діяльність.',
         'Ми&nbsp;допомагаємо малечі до&nbsp;трьох років, від&nbsp;яких відмовилися батьки, часто важко хворим. Дорослішим дітям допомагаємо в&nbsp;подоланні серйозних хвороб. Сьогодні рахунок таких дітей йде&nbsp;вже на&nbsp;сотні.',
         'Сьогодні наш&nbsp;фонд надає благодійну допомогу всім нужденним незалежно від&nbsp;національності, громадянства та&nbsp;соціального становища.'
      ],
    ],
  ];

?>