<?php
  /***** Translations file *****/
  /*** Translations functions ***/
  function set($data, $check = false, $replace = false) {
    if($check) {
      if(!isset($data) || !$data) {
        return false;
      }
    }
    if($replace) {
      $data = $replace;
    }
    echo $data;
    return;
  };
  function setLink($data, $type) {
    switch($type) {
      case 'phone':
        echo 'tel:'.preg_replace('/\D/', '', $data);
        break;
      case 'email':
        echo 'mailto:'.trim($data);
        break;
      default:
        break;
    }
    return;
  }

  $config = [
    'phone' => [
      'text' => '+380&nbsp;(68)&nbsp;804&nbsp;80&nbsp;44',
      'link' => '+380688048044'
    ],
    'email' => 'info@entrout.com.ua',
    'work_time' => [
      'from' => '9:00',
      'to' => '18:00'
    ],
    'protocol' => isset($_SERVER['HTTPS']) ? "https://" : "http://",
    'domain' => $_SERVER['HTTP_HOST']
  ];

  /*** Microdata translations ***/
  $languages['microdata'] = [
    'logo' => [
      'ru' => $config['protocol'].$config['domain'].'/images/common/logo_ru.png',
      'uk' => $config['protocol'].$config['domain'].'/images/common/logo_uk.png',
    ],
    'google' => [
      'image' => [
        'ru' => $config['protocol'].$config['domain'].'/images/common/socials_ru.png',
        'uk' => $config['protocol'].$config['domain'].'/images/common/socials_uk.jpg'
      ],
    ],
    'facebook' => [
      'image' => [
        'ru' => $config['protocol'].$config['domain'].'/images/common/socials_ru.png',
        'uk' => $config['protocol'].$config['domain'].'/images/common/socials_uk.jpg'
      ],
      'type' => 'image/jpeg',
      'width' => 1200,
      'height' => 630
    ],
    'twitter' => [
      'creator' => '',
      'image' => [
        'ru' => $config['protocol'].$config['domain'].'/images/common/socials_ru.png',
        'uk' => $config['protocol'].$config['domain'].'/images/common/socials_uk.jpg'
      ],
    ]
  ];

  /*** Site translations ***/
  $languages['site'] = [
    'title' => [
      'ru' => 'Бухгалтерские услуги для компаний и предпринимателей',
      'uk' => 'Бухгалтерські послуги для компаній і підприємств',
    ],
    'description' => [
      'ru' => 'Ведение бухгалтерии предприятия на общей системе, НДС, сотрудники, бухгалтерские услуги для частного предпринимателя на едином налоге от 1000 грн, бухгалтер для IT-компании.',
      'uk' => 'Ведення бухгалтерії для підприємств на загальній системі, ПДВ, працівники, бухгалтерські послуги для приватного підприємця на єдиному податку від 1000 грн, бухгалтер IT-компанії.',
    ],
    'keywords' => [
      'ru' => 'ведение бухгалтерии фоп, бухгалтер для фоп киев, ведение спд, бухгалтерские услуги для флп киев, сколько стоят услуги бухгалтера для спд, бухгалтерские услуги киев стоимость, стоимость услуг бухгалтера на дому, бухгалтерские услуги цена киев, бухгалтер в it компанию киев, ведение бухгалтерского учёта аутсорсинг, бухгалтерский учет в it компаниях, бухгалтер для программиста, бухгалтер отчетность, бухгалтер на нулевую отчётность',
      'uk' => 'ведення бухгалтерії фоп, бухгалтер для фоп київ, ведення спд, бухгалтерські послуги для фоп київ, скільки коштують послуги бухгалтера для спд, бухгалтерські послуги прайс, бухгалтерські послуги київ вартість, бухгалтерські послуги ціна київ, бухгалтер в it компанію київ, ведення бухгалтерського обліку аутсорсинг, бухгалтерський облік в it компаніях, бухгалтер для програміста, бухгалтер звітність, бухгалтер на нульову звітність',
    ],
    'button' => [
      'ru' => 'Оставить заявку',
      'uk' => 'Залишити запит',
    ]
  ];

  /*** Locales translations ***/
  $languages['locales'] = [
    'ru' => [
      'text' => 'Укр',
      'title' => 'Украинский язык',
      'href' => './uk',
      'locale' => 'ru'
    ],
    'uk' => [
      'text' => 'Рос',
      'title' => 'Російська мова',
      'href' => './ru',
      'locale' => 'uk'
    ]
  ];

  /*** Menu translations ***/
  $languages['menu'] = [
    'title' => [
      'ru' => 'Меню',
      'uk' => 'Меню',
    ],
    'close_title' => [
      'ru' => 'Закрыть меню',
      'uk' => 'Закрити меню',
    ],
    'items' => [
      'advantages' => [
        'ru' => 'Преимущества',
        'uk' => 'Переваги',
      ],
      'services' => [
        'ru' => 'Услуги',
        'uk' => 'Послуги',
      ],
      'process' => [
        'ru' => 'Как мы работаем',
        'uk' => 'Як ми працюємо',
      ],
      'faq' => [
        'ru' => 'Вопрос-ответ',
        'uk' => 'Запитання-відповіді',
      ],
      'contacts' => [
        'ru' => 'Контакты',
        'uk' => 'Контакти',
      ],
    ],
  ];

  /*** Header translations ***/
  $languages['header'] = [
    'logo' => [
      'ru' => 'Бухгалтер на аутсорсе',
      'uk' => 'Бухгалтер на аутсорсі',
    ],
    'title' => [
      'ru' => 'Бухгалтерские услуги для&nbsp;предпринимателей и&nbsp;компаний',
      'uk' => 'Бухгалтерські послуги для&nbsp;підприємців і&nbsp;компаній',
    ],
    'subtitle' => [
      'ru' => 'Работаем с&nbsp;бизнесами на&nbsp;едином налоге и&nbsp;на&nbsp;общей системе с&nbsp;НДС',
      'uk' => 'Працюємо з&nbsp;бізнесами на&nbsp;єдиному податку і&nbsp;на&nbsp;загальній системі з&nbsp;ПДВ',
    ],
  ];

  /*** Advantages translations ***/
  $languages['advantages'] = [
    'title' => [
      'ru' => 'Преимущества работы с&nbsp;удалённым бухгалтером',
      'uk' => 'Переваги роботи з&nbsp;бухгалтером на аутсорсі',
    ],
    'list' => [
      'economy' => [
        'title' => [
          'ru' => 'Экономия',
          'uk' => 'Економія',
        ],
        'text' => [
          'ru' => 'Не&nbsp;нужно брать бухгалтера в&nbsp;штат, оборудовать рабочее место, платить за&nbsp;него налоги и&nbsp;больничные, если он&nbsp;заболеет.',
          'uk' => 'Не&nbsp;потрібно брати бухгалтера в&nbsp;штат, обладнувати робоче місце, платити за&nbsp;нього податки і&nbsp;лікарняні, якщо він&nbsp;захворіє.',
        ],
      ],
      'time' => [
        'title' => [
          'ru' => 'Не&nbsp;тратите время',
          'uk' => 'Не&nbsp;витрачайте час',
        ],
        'text' => [
          'ru' => 'Вам не&nbsp;придётся изучать законодательство, разбираться в&nbsp;бухучёте и&nbsp;налогообложении, общаться с&nbsp;налоговой, если возникнут проблемы.',
          'uk' => 'Вам не&nbsp;доведеться вивчати законодавство, розбиратися в&nbsp;бухобліку і&nbsp;оподаткуванні, спілкуватися з&nbsp;податковою, якщо виникнуть проблеми.',
        ],
      ],
      'in_touch' => [
        'title' => [
          'ru' => 'Всегда на&nbsp;связи',
          'uk' => "Завжди на&nbsp;зв'язку",
        ],
        'text' => [
          'ru' => 'Ваш&nbsp;бухгалтер всегда доступен, общение проходит в&nbsp;удобном для&nbsp;вас формате: по&nbsp;телефону или&nbsp;электронной почте.',
          'uk' => "Ваш&nbsp;бухгалтер завжди доступний, спілкуйтеся з&nbsp;ним у зручному для&nbsp;вас форматі: по&nbsp;телефону або&nbsp;електронній пошті.",
        ],
      ],
      'control' => [
        'title' => [
          'ru' => 'Контроль',
          'uk' => 'Контроль',
        ],
        'text' => [
          'ru' => 'Для&nbsp;предпринимателей возможна совместная работа в&nbsp;удобном онлайн-сервисе.',
          'uk' => 'Для&nbsp;підприємців можлива спільна робота в&nbsp;зручному онлайн-сервісі.',
        ],
      ],
      'professionals' => [
        'title' => [
          'ru' => 'Профессионалы и&nbsp;эксперты',
          'uk' => 'Професіонали та&nbsp;експерти',
        ],
        'text' => [
          'ru' => 'Вести бухгалтерию вашего бизнеса будут квалифицированные бухгалтеры с&nbsp;опытом работы от&nbsp;10&nbsp;лет.',
          'uk' => 'Вести бухгалтерію вашого бізнесу будуть кваліфіковані бухгалтери з&nbsp;досвідом роботи від&nbsp;10&nbsp;років.',
        ],
      ],
      'manufacturability' => [
        'title' => [
          'ru' => 'Технологичность',
          'uk' => 'Технологічність',
        ],
        'text' => [
          'ru' => 'Используем современные сервисы и&nbsp;программы для&nbsp;ведения бухгалтерии и&nbsp;общения с&nbsp;клиентами.',
          'uk' => 'Використовуємо сучасні сервіси та&nbsp;програми для&nbsp;ведення бухгалтерії й&nbsp;спілкування з&nbsp;клієнтами.',
        ],
      ],
      'confidentiality' => [
        'title' => [
          'ru' => 'Конфиденциальность',
          'uk' => 'Конфіденційність',
        ],
        'text' => [
          'ru' => 'Мы&nbsp;гарантируем полную конфиденциальность и&nbsp;безопасность данных вашего бизнеса.',
          'uk' => 'Ми&nbsp;гарантуємо повну конфіденційність і&nbsp;безпеку даних вашого бізнесу.',
        ],
      ],
      'tariffs' => [
        'title' => [
          'ru' => 'Гибкие тарифы',
          'uk' => 'Гнучкі тарифи',
        ],
        'text' => [
          'ru' => 'Стоимость обслуживания зависит от&nbsp;потребностей вашего бизнеса. Вы&nbsp;не&nbsp;платите за&nbsp;ненужные услуги.',
          'uk' => 'Вартість обслуговування залежить від&nbsp;потреб вашого бізнесу. Ви&nbsp;не&nbsp;платите за&nbsp;непотрібні послуги.',
        ],
      ],
    ],
  ];

  /*** About translations ***/
  $languages['about'] = [
    'title' => [
      'ru' => 'Бухгалтер на&nbsp;аутсорсе выгоден для&nbsp;бизнеса',
      'uk' => 'Бухгалтер на&nbsp;аутсорсі вигідний для&nbsp;бізнесу',
    ],
    'column_left' => [
      'ru' => 'Удалённая команда профессионалов занимается вашей бухгалтерией: вовремя сдаёт отчётность, решает вопросы с&nbsp;налоговой и&nbsp;выполняют ваши задания. В&nbsp;это&nbsp;время вы&nbsp;занимаетесь бизнесом и&nbsp;не&nbsp;тратите время на&nbsp;рутину.',
      'uk' => 'Команда професіоналів займається вашою бухгалтерією: вчасно здає звітність, вирішує питання з&nbsp;податковою і&nbsp;виконує ваші завдання. А&nbsp;ви в&nbsp;цей&nbsp;час займаєтеся бізнесом і&nbsp;не&nbsp;витрачаєте час на&nbsp;рутину.',
    ],
    'column_right' => [
      'ru' => 'Вам не&nbsp;нужно оборудовать рабочее место для&nbsp;бухгалтера, покупать специальные программы, подписку на&nbsp;профессиональную периодику и&nbsp;оплачивать курсы повышения квалификации.',
      'uk' => 'Вам не&nbsp;потрібно обладнувати робоче місце для&nbsp;бухгалтера, купувати спеціальні програми, підписку на&nbsp;професійну періодику і&nbsp;оплачувати курси підвищення кваліфікації.',
    ],
    'text_top' => [
      'ru' => 'Вы&nbsp;получаете состоявшегося специалиста с&nbsp;многолетним опытом работы в&nbsp;вашей сфере без&nbsp;лишних затрат.',
      'uk' => 'Ви&nbsp;отримуєте кваліфікованого професіонала з&nbsp;багаторічним досвідом роботи у&nbsp;вашій сфері без&nbsp;зайвих витрат.',
    ],
    'text_bottom' => [
      'ru' => 'Работаем с&nbsp;компаниями и&nbsp;предпринимателями из&nbsp;Киева и&nbsp;Киевской области.',
      'uk' => 'Працюємо з&nbsp;компаніями та&nbsp;підприємцями із&nbsp;Києва та&nbsp;Київської області.',
    ],
  ];

  /*** Services translations ***/
  $languages['services'] = [
    'title' => [
      'ru' => 'Бухгалтерские услуги',
      'uk' => 'Бухгалтерські послуги',
    ],
    'subtitle' => [
      'ru' => 'Мы&nbsp;подберем удобную и&nbsp;выгодную схему работы под&nbsp;потребности вашего бизнеса и&nbsp;сформируем персональный пакет услуг.',
      'uk' => 'Ми&nbsp;підберемо зручну та&nbsp;вигідну схему роботи під&nbsp;потреби вашого бізнесу і&nbsp;сформуємо персональний пакет послуг.',
    ],
    'blocks' => [
      'no_employees' => [
        'title' => [
          'ru' => '«Предприниматель»',
          'uk' => '«Підприємець»',
        ],
        'title_description' => [
          'ru' => 'Без&nbsp;НДС, ВЭД, сотрудников и&nbsp;акциза',
          'uk' => 'Без&nbsp;ПДВ, ЗЕД, співробітників і&nbsp;акцизу',
        ],
        'price' => [
          'ru' => '1&thinsp;000&nbsp;',
          'uk' => '1&thinsp;000&nbsp;',
        ],
        'price_currency' => [
          'ru' => 'грн',
          'uk' => 'грн',
        ],
        'price_time' => [
          'ru' => '/мес.',
          'uk' => '/міс.',
        ],
        'price_description' => [
          'ru' => 'до&nbsp;35 операций',
          'uk' => 'до&nbsp;35 операцій',
        ],
        'texts' => [
          'ru' => [
            'Ведение учёта на&nbsp;основании первичных документов',
            'Оповещения о&nbsp;размере налогов и&nbsp;сборов, формирование платёжных поручений для&nbsp;уплаты',
            'Ведение книги доходов и&nbsp;расходов',
            'Формирование и&nbsp;сдача отчётности в&nbsp;налоговую',
            'Пять консультаций экспертов по&nbsp;налогам'
          ],
          'uk' => [
            'Ведення обліку на&nbsp;підставі первинних документів',
            'Оповіщення про&nbsp;розмір податків і&nbsp;зборів, формування платіжних доручень для&nbsp;сплати',
            'Ведення книги доходів і&nbsp;витрат',
            'Формування і&nbsp;подання звітності до&nbsp;податкової',
            'П’ять консультацій експертів з&nbsp;податків'
          ],
        ],
      ],
      'company' => [
        'title' => [
          'ru' => '«Предприятие»',
          'uk' => '«Підприємство»',
        ],
        'title_description' => [
          'ru' => 'Без&nbsp;НДС, ВЭД и&nbsp;акциза',
          'uk' => 'Без&nbsp;ПДВ, ЗЕД і&nbsp;акцизу',
        ],
        'price' => [
          'ru' => '3&thinsp;500&nbsp;',
          'uk' => '3&thinsp;500&nbsp;',
        ],
        'price_currency' => [
          'ru' => 'грн',
          'uk' => 'грн',
        ],
        'price_time' => [
          'ru' => '/мес.',
          'uk' => '/міс.',
        ],
        'price_description' => [
          'ru' => 'до&nbsp;50 операций',
          'uk' => 'до&nbsp;50 операцій',
        ],
        'texts' => [
          'ru' => [
            'Создание и&nbsp;ведение учётной базы;',
            'Работа с&nbsp;бухгалтерскими документами: создание исходящей, обработка входящей документации, первичные документы',
            'Работа с&nbsp;клиент-банком. Импорт операций по&nbsp;счёту в&nbsp;учётную систему',
            'Составление и&nbsp;подача отчётности',
            'Консультации бухгалтеров-экспертов',
            'Взаимодействие с&nbsp;налоговой, ответы на&nbsp;запросы',
            'Расчёт зарплаты: до&nbsp;3-х работников (последующие +100 грн/раб.)'
          ],
          'uk' => [
            'Створення і&nbsp;ведення облікової бази',
            'Робота з&nbsp;бухгалтерськими документами: створення вихідної, обробка вхідної документації, первинні документи',
            'Робота з&nbsp;клієнт-банком. Імпорт операцій за&nbsp;рахунком в&nbsp;обліковий систему',
            'Складання та&nbsp;подання звітності',
            'Консультації бухгалтерів-експертів',
            'Взаємодія з податковою, відповіді на&nbsp;запити',
            'Розрахунок зарплати: до&nbsp;3-х працівників (наступні +100 грн/особа)'
          ],
        ],
      ],
      'it' => [
        'title' => [
          'ru' => 'Бухгалтер для IT-компаний',
          'uk' => 'Бухгалтер для IT-компаній',
        ],
        'title_description' => [
          'ru' => 'без&nbsp;НДС',
          'uk' => 'без&nbsp;ПДВ',
        ],
        'price' => [
          'ru' => '5&thinsp;000&nbsp;',
          'uk' => '5&thinsp;000&nbsp;',
        ],
        'price_currency' => [
          'ru' => 'грн',
          'uk' => 'грн',
        ],
        'price_time' => [
          'ru' => '/мес.',
          'uk' => '/міс.',
        ],
        'price_description' => [
          'ru' => '&nbsp;',
          'uk' => '&nbsp;',
        ],
        'texts' => [
          'ru' => [
            'Документооборот с&nbsp;контрагентами',
            'Ведение бухгалтерии',
            'ВЭД',
            'Формирование и&nbsp;подача отчётности',
            'Расчёт налогов и&nbsp;сборов',
            'Формирование платёжек на&nbsp;уплату',
            'Расчёт зарплаты: до&nbsp;3-х работников (последующие +100 грн/раб.)'
          ],
          'uk' => [
            'Документообіг з&nbsp;контрагентами',
            'Ведення бухгалтерії',
            'ЗЕД',
            'Формування і&nbsp;подання звітності',
            'Розрахунок податків і&nbsp;зборів',
            'Формування платіжних доручень на&nbsp;сплату',
            'Розрахунок зарплати: до 3-х працівників (наступні +100 грн /особа)'
          ],
        ],
      ],
    ],
    'additional' => [
      'title' => [
        'ru' => 'Дополнительно вы&nbsp;можете заказать услуги',
        'uk' => 'Додатково ви&nbsp;можете замовити послуги',
      ],
      'blocks' => [
        '0' => [
          'service' => [
            'ru' => 'Ведение участка&nbsp;«НДС»',
            'uk' => '«ПДВ»',
          ],
          'price' => [
            'ru' => '1&thinsp;500&nbsp;',
            'uk' => '1&thinsp;500&nbsp;',
          ],
          'price_currency' => [
            'ru' => 'грн',
            'uk' => 'грн',
          ],
          'price_time' => [
            'ru' => '/мес.',
            'uk' => '/міс.',
          ],
          'description' => [
            'ru' => 'до&nbsp;20 операций',
            'uk' => 'до&nbsp;20 операцій',
          ],
          'features' => [
            'ru' => [
              'формирование налоговых накладных;',
              'подбор кодов УКТ&nbsp;ВЭД к&nbsp;товарам и&nbsp;услугам;',
              'регистрация налоговых накладных;',
              'контроль регистрации налоговых накладных от&nbsp;поставщиков;',
              'подготовка налоговой декларации по&nbsp;НДС;',
              'формирование платёжного поручения на&nbsp;уплату налогов;',
              'три консультации экспертов по&nbsp;налогам.'
            ],
            'uk' => [
              'формування податкових накладних;',
              'підбір кодів УКТ&nbsp;ЗЕД до&nbsp;товарів і&nbsp;послуг;',
              'реєстрація податкових накладних;',
              'контроль реєстрації податкових накладних від&nbsp;постачальників;',
              'підготовка податкової декларації з&nbsp;ПДВ;',
              'формування платіжного доручення на&nbsp;сплату податків;',
              'три консультації експертів з&nbsp;податків.'
            ],
          ],
        ],
        '1' => [
          'service' => [
            'ru' => '«Зарплата и&nbsp;наёмные работники»',
            'uk' => '«Зарплата і&nbsp;наймані працівники»',
          ],
          'price' => [
            'ru' => '600&nbsp;',
            'uk' => '600&nbsp;',
          ],
          'price_currency' => [
            'ru' => 'грн',
            'uk' => 'грн',
          ],
          'price_time' => [
            'ru' => '/мес.',
            'uk' => '/міс.',
          ],
          'description' => [
            'ru' => 'до&nbsp;3-х работников <br>(последующие +100 грн/раб.)',
            'uk' => 'до&nbsp;3-х працівників <br>(наступні +100 грн/особа)',
          ],
          'features' => [
            'ru' => [
              'расчёт заработной платы;',
              'формирование ведомостей на&nbsp;выплату зарплаты;',
              'формирование платёжных поручений на&nbsp;оплату налогов и&nbsp;сборов;',
              'подготовка штатного расписания и&nbsp;табелей учёта рабочего времени;',
              'подача отчётности (Д4&nbsp;и&nbsp;1ДФ).'
            ],
            'uk' => [
              'розрахунок заробітної плати;',
              'формування відомостей на&nbsp;виплату зарплати;',
              'формування платіжних доручень на сплату податків і&nbsp;зборів;',
              'підготовка штатного розкладу і&nbsp;табелів обліку робочого часу;',
              'подання звітності (Д4&nbsp;і&nbsp;1ДФ).'
            ],
          ],
        ],
        '2' => [
          'service' => [
            'ru' => '«Отчётность предпринимателя»',
            'uk' => '«Звітність підприємця»',
          ],
          'price' => [
            'ru' => '100&nbsp;',
            'uk' => '100&nbsp;',
          ],
          'price_currency' => [
            'ru' => 'грн',
            'uk' => 'грн',
          ],
          'price_time' => [
            'ru' => '/мес.',
            'uk' => '/міс.',
          ],
          'description' => [
            'ru' => '',
            'uk' => '',
          ],
          'features' => [
            'ru' => ['заполнение и&nbsp;подача отчётности за&nbsp;предпринимателя.'],
            'uk' => ['заповнення та&nbsp;подання звітності за&nbsp;підприємця.'],
          ],
        ],
      ]
    ]
  ];

  /*** About translations ***/
  $languages['phone'] = [
    'text' => [
      'ru' => 'Подберём удобную и&nbsp;выгодную схему работы под&nbsp;потребности вашего бизнеса ',
      'uk' => 'Підберемо зручну та&nbsp;вигідну схему роботи під&nbsp;потреби вашого бізнесу '
    ],
  ];

  /*** FAQ translations ***/
  $languages['faq'] = [
    'title' => [
      'ru' => 'Вопрос-ответ',
      'uk' => 'Запитання-відповідь'
    ],
    'subtitle' => [
      'ru' => 'Если у&nbsp;вас есть дополнительные вопросы — обращайтесь, мы&nbsp;на&nbsp;связи.',
      'uk' => "Якщо у&nbsp;вас виникли якісь запитання — звертайтеся, ми&nbsp;на&nbsp;зв'язку."
    ],
    'blocks' => [
      '0' => [
        'question' => [
          'ru' => 'На&nbsp;время переезжаю за&nbsp;границу, вести деятельность в&nbsp;этот период не&nbsp;буду, боюсь что-то&nbsp;упущу и&nbsp;будут штрафы. Что&nbsp;порекомендуете таким предпринимателям, как&nbsp;я?',
          'uk' => 'Деякий час житиму за&nbsp;кордоном, вести діяльність в&nbsp;цей період не&nbsp;буду, але&nbsp;боюся щоб&nbsp;не&nbsp;було штрафів. Що&nbsp;порадите таким підприємцям, як&nbsp;я?'
        ],
        'answer' => [
          'ru' => 'Выбирайте услугу «Отчётность». Даже если не&nbsp;ведёте деятельность, сдавать отчётность и&nbsp;платить налоги и&nbsp;сборы надо. Чтобы вы&nbsp;ничего забыли и&nbsp;не&nbsp;«попали» на&nbsp;штрафы, персональный бухгалтер будет подавать нулёвки за&nbsp;вас.',
          'uk' => 'Оберіть послугу «Звітність». Навіть якщо не&nbsp;ведете діяльність, здавати звітність та&nbsp;сплачувати податки і&nbsp;збори треба. Щоб&nbsp;ви&nbsp;нічого забули і&nbsp;вас не&nbsp;оштрафували, персональний бухгалтер буде подавати нульовки за&nbsp;вас.'
        ],
      ],
      '1' => [
        'question' => [
          'ru' => 'Оказываете ли&nbsp;услуги по&nbsp;восстановлению учёта?',
          'uk' => 'Чи&nbsp;надаєте послуги з&nbsp;відновлення обліку?'
        ],
        'answer' => [
          'ru' => 'Да,&nbsp;вы можете заказать эту&nbsp;услугу. Стоимость будет зависеть от&nbsp;объёма данных, и&nbsp;за&nbsp;какой период их&nbsp;надо восстанавливать.',
          'uk' => 'Так,&nbsp;ви можете замовити цю&nbsp;послугу. Вартість залежатиме від&nbsp;об’єму даних, та&nbsp;за&nbsp;який період їх&nbsp;треба відновлювати.'
        ],
      ],
      '2' => [
        'question' => [
          'ru' => 'Как&nbsp;часто можно обращаться к&nbsp;персональному бухгалтеру за&nbsp;консультацией?',
          'uk' => 'Як&nbsp;часто можна звертатися до&nbsp;персонального бухгалтера за&nbsp;консультацією?'
        ],
        'answer' => [
          'ru' => 'Количество консультаций зависит от&nbsp;выбранного пакета. Если вам&nbsp;нужно больше, мы&nbsp;сможем разработаем персональное предложение с&nbsp;выгодными для&nbsp;вас условиями.',
          'uk' => 'Кількість консультацій залежить від&nbsp;обраного пакета. Якщо вам&nbsp;потрібно більше, ми&nbsp;зможемо розробимо персональну пропозицію з&nbsp;вигідними для&nbsp;вас умовами.'
        ],
      ],
      '3' => [
        'question' => [
          'ru' => 'Если я&nbsp;захочу прекратить сотрудничество, в&nbsp;какой форме я&nbsp;смогу получить данные учёта от&nbsp;бухгалтера?',
          'uk' => 'Якщо я&nbsp;захочу припинити співпрацю, в&nbsp;якій формі я&nbsp;зможу отримати дані обліку від&nbsp;бухгалтера?'
        ],
        'answer' => [
          'ru' => 'В&nbsp;оговоренные в&nbsp;договоре сроки мы&nbsp;вернём вам полный пакет документов, если передавались оригиналы. Сделаем выгрузку данных из&nbsp;бухгалтерской программы и&nbsp;закроем доступ бухгалтеру к&nbsp;вашим аккаунтам в&nbsp;учётных системах.',
          'uk' => 'У&nbsp;встановлені угодою строки ми&nbsp;повернемо вам повний пакет документів, якщо передавалися оригінали. Вивантажимо дані з&nbsp;бухгалтерської програми і&nbsp;закриємо доступ бухгалтеру до&nbsp;ваших акаунтів в&nbsp;облікових системах.'
        ],
      ],
    ],
  ];

  /*** Process translations ***/
  $languages['process'] = [
    'title' => [
      'ru' => 'Как&nbsp;работает удалённый бухгалтер с ',
      'uk' => 'Як&nbsp;працює бухгалтер на&nbsp;аутсорсі з '
    ],
    'tabs' => [
      'entrepreneur' => [
        'title' => [
          'ru' => 'предпринимателем ',
          'uk' => 'підприємцем '
        ],
        'alt' => [
          'ru' => 'Обмен документами с бухгалтером происходит через онлайн-сервис «Смарт бухгалтерия»',
          'uk' => 'Обмін документами з бухгалтером відбувається через онлайн-сервіс «Смарт бухгалтерія»'
        ],
        'data' => [
          [
            'type' => 'text',
            'text' => [
              'ru' => 'Обмен документами с&nbsp;бухгалтером происходит через онлайн-сервис «',
              'uk' => 'Обмін документами з&nbsp;бухгалтером відбувається через онлайн-сервіс «'
            ],
          ],
          [
            'type' => 'link',
            'text' => [
              'ru' => 'Смарт бухгалтерия',
              'uk' => 'Смарт бухгалтерія'
            ],
            'title' => [
              'ru' => 'Смарт бухгалтерия',
              'uk' => 'Смарт бухгалтерія'
            ],
            'href' => [
              'ru' => 'https://smcs.com.ua/ru',
              'uk' => 'https://smcs.com.ua/uk'
            ],
          ],
          [
            'type' => 'text',
            'text' => [
              'ru' => '».',
              'uk' => '».'
            ],
          ],
          [
            'type' => 'list',
            'heading' => [
              'ru' => 'Ваш персональный бухгалтер:',
              'uk' => 'Ваш персональний бухгалтер:'
            ],
            'items' => [
              'ru' => [
                'информирует вас о&nbsp;состоянии дел;',
                'общается с&nbsp;налоговой вместо вас;',
                'консультирует, в&nbsp;каком банке лучше открыть счёт;',
                'составляет и&nbsp;сдаёт отчётность в&nbsp;налоговую.'
              ],
              'uk' => [
                'інформує вас про&nbsp;стан справ;',
                'спілкується з&nbsp;податковою замість вас;',
                'консультує, в&nbsp;якому банку краще відкрити рахунок;',
                'складає і&nbsp;подає звітність в&nbsp;податкову'
              ]
            ],
            'post_heading' => [
              'ru' => 'И выполняет ещё много полезной работы для&nbsp;вашего бизнеса!',
              'uk' => 'І виконує ще&nbsp;багато корисної роботи для&nbsp;вашого бізнесу!'
            ],
          ],
        ]
      ],
      'organization' => [
        'title' => [
          'ru' => ' организацией',
          'uk' => ' організацією'
        ],
        'alt' => [
          'ru' => 'Обмен документами происходит удобным для вас способом: лично вбумажном виде или по электронной почте',
          'uk' => 'Обмін документами відбувається зручним для вас способом: особисто в паперовому вигляді або електронною поштою'
        ],
        'data' => [
          [
            'type' => 'text',
            'text' => [
              'ru' => 'Обмен документами происходит удобным для&nbsp;вас способом: лично в&nbsp;бумажном виде или&nbsp;по&nbsp;электронной почте.',
              'uk' => 'Обмін документами відбувається зручним для&nbsp;вас способом: особисто в&nbsp;паперовому вигляді або&nbsp;електронною поштою.'
            ]
          ],
          [
            'type' => 'list',
            'heading' => [
              'ru' => 'Ваш персональный бухгалтер:',
              'uk' => 'Ваш персональний бухгалтер:'
            ],
            'items' => [
              'ru' => [
                'составляет и&nbsp;подаёт отчётность;',
                'выполняет полный комплекс работ по ведению бухгалтерского учёта вашего предприятия;',
                'формирует платежки на&nbsp;уплату налогов и&nbsp;сборов;',
                'общается с&nbsp;налоговой вместо вас.'
              ],
              'uk' => [
                'складає і&nbsp;подає звітність;',
                'виконує повний комплекс робіт з&nbsp;ведення бухгалтерського обліку вашого підприємства;',
                'формує платіжки на&nbsp;сплату податків і&nbsp;зборів;',
                'спілкується з&nbsp;податковою замість вас.'
              ]
            ],
            'post_heading' => [
              'ru' => 'И&nbsp;выполняет ещё&nbsp;много полезной работы для&nbsp;вашего бизнеса!',
              'uk' => 'І&nbsp;виконує ще&nbsp;багато корисної роботи для&nbsp;вашого бізнесу!'
            ],
          ],
        ],
      ],
    ],
    'steps' => [
      '01' => [
        'ru' => 'Вы оставляете запрос на&nbsp;сайте, а&nbsp;мы&nbsp;связываемся с&nbsp;вами.',
        'uk' => 'Ви залишаєте запит на&nbsp;сайті, а&nbsp;ми&nbsp;зв’яжемось з&nbsp;вами.'
      ],
      '02' => [
        'ru' => 'На&nbsp;личной встрече или&nbsp;по&nbsp;телефону обсуждаем подходящий вам вариант сотрудничества.',
        'uk' => 'На&nbsp;особистій зустрічі або&nbsp;по&nbsp;телефону обговорюємо варіант співпраці, що&nbsp;підходить саме&nbsp;вам'
      ],
      '03' => [
        'ru' => 'Подписываем договор о&nbsp;сотрудничестве.',
        'uk' => 'Підписуємо договір про&nbsp;співпрацю.'
      ],
      '04' => [
        'ru' => 'Приступаем к&nbsp;работе!',
        'uk' => 'Приступаємо до&nbsp;роботи!'
      ],
    ]
  ];

  /*** Contacts translations ***/
  $languages['contacts'] = [
    'title' => [
      'ru' => 'Оставьте заявку',
      'uk' => 'Залиште запит',
    ],
    'text' => [
      'ru' => 'Подберём для&nbsp;вас выгодный тарифный план и&nbsp;назначим встречу.',
      'uk' => 'Підберемо для&nbsp;вас вигідний тарифний план і&nbsp;призначимо зустріч.',
    ],
    'name' => [
      'ru' => 'Имя',
      'uk' => "Ім'я",
    ],
    'phone' => [
      'ru' => 'Телефон *',
      'uk' => 'Телефон *',
    ],
    'email' => [
      'ru' => 'Электронная почта',
      'uk' => 'Електронна пошта',
    ],
    'send' => [
      'ru' => 'Отправить',
      'uk' => 'Відправити',
    ],
  ];

  /*** Footer translations ***/
  $languages['footer'] = [
    'address' => [
      'country' => [
        'ru' => 'Украина',
        'uk' => 'Україна',
      ],
      'city' => [
        'ru' => 'г.&nbsp;Киев',
        'uk' => 'м.&nbsp;Київ',
      ],
      'street' => [
        'ru' => 'ул.&nbsp;Эспланадная,&nbsp;1',
        'uk' => 'вул.&nbsp;Еспланадна,&nbsp;1',
      ],
      'description' => [
        'ru' => 'БЦ&nbsp;Гулливер',
        'uk' => 'БЦ&nbsp;Гуллівер',
      ],
      'location' => [
        'ru' => 'БЦ Гулливер',
        'uk' => 'БЦ Гуллівер',
      ],
    ],
    'work_time' => [
      'before' => [
        'ru' => 'Мы работаем с',
        'uk' => 'Ми працюємо з',
      ],
      'to' => [
        'ru' => 'до',
        'uk' => 'до',
      ],
      'after' => [
        'ru' => 'в&nbsp;будни.',
        'uk' => 'у&nbsp;будні.',
      ],
    ]
  ];

  /*** Modal translations ***/
  $languages['modal'] = [
    'callback' => [
      'button' => [
        'title' => [
          'ru' => 'Заказать звонок',
          'uk' => 'Замовити дзвінок',
        ]
      ],
      'title' => [
        'ru' => 'Возможно, у&nbsp;вас есть вопросы или&nbsp;нужна помощь',
        'uk' => 'Можливо, ви&nbsp;маєте запитання чи&nbsp;потребуєте допомоги',
      ],
      'text' => [
        'ru' => 'Оставьте номер телефона — и&nbsp;мы&nbsp;перезвоним вам.',
        'uk' => 'Залиште номер телефону — і&nbsp;ми&nbsp;передзвонимо вам.',
      ],
      'phone' => [
        'ru' => 'Телефон *',
        'uk' => 'Телефон *',
      ],
      'send' => [
        'ru' => 'Заказать звонок',
        'uk' => 'Замовити дзвінок',
      ],
    ],
    'request' => [
      'title' => [
        'ru' => 'Заявка на бухгалтерское обслуживание',
        'uk' => 'Заявка на бухгалтерське обслуговування',
      ],
      'name' => [
        'ru' => 'Имя',
        'uk' => "Ім'я",
      ],
      'phone' => [
        'ru' => 'Телефон *',
        'uk' => 'Телефон *',
      ],
      'message' => [
        'ru' => 'Сообщение',
        'uk' => 'Повідомлення',
      ],
      'send' => [
        'ru' => 'Отправить',
        'uk' => 'Відправити',
      ]
    ]
  ];

  /*** Form translations ***/
  $languages['form'] = [
    'sending' => [
      'ru' => 'Запрос отправляется.',
      'uk' => 'Запит відправляється.',
    ],
    'success' => [
      'ru' => 'Мы свяжемся с&nbsp;вами в&nbsp;ближайшее время.',
      'uk' => 'Ми зв’яжемося з&nbsp;вами найближчим часом.',
    ],
    'error' => [
      'ru' => 'Не&nbsp;отправлено. Пожалуйста, попробуйте отправить запрос ещё&nbsp;раз.',
      'uk' => 'Не&nbsp;відправлено. Будь&nbsp;ласка, спробуйте надіслати запит ще&nbsp;раз.',
    ],
    'restore' => [
      'ru' => 'Ok',
      'uk' => 'Ok',
    ],
    'repeat' => [
      'ru' => 'try again',
      'uk' => 'try again',
    ],
  ];
?>