<?php
  /***** Translations file *****/
  /*** Translations functions ***/
  function set($data, $check = false, $replace = false) {
    if($check) {
      if(!isset($data) || !$data) {
        return false;
      }
    }
    if($replace) {
      $data = $replace;
    }
    echo $data;
    return;
  };
  function setLink($data, $type) {
    switch($type) {
      case 'phone':
        echo 'tel:'.preg_replace('/\D/', '', $data);
        break;
      case 'email':
        echo 'mailto:'.trim($data);
        break;
      default:
        break;
    }
    return;
  }

  $config = [
    'email' => 'foundation@klimenko.com',
    'protocol' => isset($_SERVER['HTTPS']) ? "https://" : "http://",
    'domain' => $_SERVER['HTTP_HOST']
  ];

  /*** Microdata translations ***/
  $languages['microdata'] = [
    'logo' => [
      'ru' => $config['protocol'].$config['domain'].'/images/common/logo_ru.png',
      'uk' => $config['protocol'].$config['domain'].'/images/common/logo_uk.png',
    ],
    'google' => [
      'image' => [
        'ru' => $config['protocol'].$config['domain'].'/images/common/socials_ru.png',
        'uk' => $config['protocol'].$config['domain'].'/images/common/socials_uk.jpg'
      ],
    ],
    'facebook' => [
      'image' => [
        'ru' => $config['protocol'].$config['domain'].'/images/common/socials_ru.png',
        'uk' => $config['protocol'].$config['domain'].'/images/common/socials_uk.jpg'
      ],
      'type' => 'image/jpeg',
      'width' => 1200,
      'height' => 630
    ],
    'twitter' => [
      'creator' => '',
      'image' => [
        'ru' => $config['protocol'].$config['domain'].'/images/common/socials_ru.png',
        'uk' => $config['protocol'].$config['domain'].'/images/common/socials_uk.jpg'
      ],
    ]
  ];

  /*** Site translations ***/
  $languages['site'] = [
    'title' => [
      'ru' => 'Klymenko charity family foundation',
      'uk' => 'Klymenko charity family foundation',
    ],
    'description' => [
      'ru' => '',
      'uk' => '',
    ],
    'keywords' => [
      'ru' => '',
      'uk' => '',
    ]
  ];

  /*** Locales translations ***/
  $languages['locales'] = [
    'ru' => [
      'text' => 'Укр',
      'title' => 'Украинский язык',
      'href' => './uk',
      'locale' => 'ru'
    ],
    'uk' => [
      'text' => 'Рос',
      'title' => 'Російська мова',
      'href' => './ru',
      'locale' => 'uk'
    ]
  ];

  /*** Menu translations ***/
  $languages['menu'] = [
    'items' => [
      'kids' => [
        'ru' => 'Помощь детям',
        'uk' => 'Допомога дітям',
      ],
      'temples' => [
        'ru' => 'Пожертвования храмам',
        'uk' => 'Пожертва храмам',
      ],
      'founders' => [
        'ru' => 'Основатели',
        'uk' => 'Засновники',
      ]
    ],
  ];

  /*** Header translations ***/
  $languages['header'] = [
    'title' => [
      'ru' => 'Благотворительный фонд Klymenko charity family foundation',
      'uk' => 'Благодійний фонд Klymenko charity family foundation',
    ],
    'text' => [
      'ru' => 'Жить, чтобы побеждать, творить и созидать с именем Господа нашего Иисуса Христа, приумножая добро на Земле!',
      'uk' => "Жити, щоб перемагати і творити з ім'ям Господа нашого Ісуса Христа, примножуючи добро на Землі!",
    ],
  ];

  /*** Objects translations ***/
  $languages['kids'] = [
    'title' => [
      'ru' => 'Помощь детям',
      'uk' => 'Допомога дітям',
    ],
    'text' => [
      'ru' => 'В начале 2000-х мы посетили детское отделение туберкулезной больницы. И ужаснулись. Ребята лечились там годами, спали на сбившихся в комки подушках и матрасах. В палатах было темно и сыро…',
      'uk' => 'На початку 2000-х ми відвідали дитяче відділення туберкульозної лікарні. Це було сумне видовище. Діти лікувалися там роками, спали на старих подушках і матрацах. В палатах було темно й сиро…',
    ],
    'story' => [
      'ru' => 'Наша история',
      'uk' => 'Наша історія',
    ],
    'important' => [
      'ru' => 'Больше 100',
      'uk' => 'Більше 100',
    ],
    'description' => [
      'ru' => 'детей получили необходимую им медицинскую помощь с 2000 по 2017 годы',
      'uk' => 'дітей отримали необхідну їм медичну допомогу з 2000 по 2017 роки',
    ],
  ];

  /*** Objects translations ***/
  $languages['temples'] = [
    'title' => [
      'ru' => 'Пожертвования храмам',
      'uk' => 'Пожертва храмам',
    ],
    'text' => [
      'ru' => [
        'Наша помощь храмам и церквям началась с помощи священнику, которому не хватало средств, чтобы достроить храм. Потом мы помогли возвести колокольню, открыли трапезную и воскресную школу.',
         'В разное время мы помогли и продолжаем оказывать помощь всем епархиям Православной церкви в Украине.',
         'Из благотворительного фонда в Донецкой области мы выросли до всеукраинского, а затем и до международного, с представительствами в России и Европе.',
         'Мы благодарны каждому ребенку, семье, каждому храму за то, что приняли нашу помощь. И мы обязательно продолжим благотворительную деятельность с чувством созидания будущего и верой в Господа нашего Иисуса Христа.'
      ],
      'uk' => [
        'Наша допомога храмам і церквам розпочалася з допомоги священику, якому не вистачало коштів, щоб добудувати храм. Потім ми допомогли звести дзвіницю, відкрили трапезну і недільну школу.',
         'У різний час ми допомогли і продовжуємо надавати допомогу всім єпархіям Православної церкви в Україні.',
         'З благодійного фонду в Донецькій області ми виросли до всеукраїнського, а потім до міжнародного, з представництвами в Росії та Європі.',
         "Ми вдячні кожній дитині, родині, кожному храму за те, що прийняли нашу допомогу. І ми обов'язково продовжимо нашу благодійну діяльність з почуттям творення майбутнього і вірою в Господа нашого Ісуса Христа."
      ],
    ],
    'year' => [
      'ru' => 'год',
      'uk' => 'рік',
    ],
    'years' => [
      '2011' => [
        'ru' => 'Наш благотворительный фонд становится всеукраинским',
        'uk' => 'Наш благодійний фонд стає всеукраїнським',
      ],
      '2016' => [
        'ru' => 'Klymenko charity family foundation работает с международными проектами',
        'uk' => 'Klymenko charity family foundation працює з міжнародними проектами',
      ]
    ]
  ];

  /*** Objects translations ***/
  $languages['objects'] = [
    'title' => [
      'ru' => 'Храмы, которым мы помогаем',
      'uk' => 'Храми, яким ми допомагаємо',
    ],
    'items' => [
      '1' => [
        'title' => [
          'ru' => 'Свято-Успенская<br> Святогорская Лавра',
          'uk' => 'Свято-Успенська<br> Святогірська Лавра',
        ],
        'text' => [
          'ru' => 'Святогорская Лавра — значимый духовный центр для православной паствы восточной Украины. На сегодня отреставрирован Успенский собор, монастырская колокольня с Покровским храмом, древнейший храм обители со скитом в честь преподобных Антония и Феодосия Печерских. Восстановлен храм в честь преподобного Алексия, человека Божьего и Храм святителя Николая на верхушке меловой скалы.',
          'uk' => 'Святогірська Лавра — значний духовний центр для православної пастви східної України. На сьогодні відреставровано Успенський собор, монастирську дзвіницю з Покровським храмом, найдавніший храм обителі зі скитом на честь преподобних Антонія і Феодосія Печерських. Відновлено храм на честь преподобного Олексія, чоловіка Божого і Храм святителя Миколая на верхівці крейдяної скелі.',
        ],
      ],
      '2' => [
        'title' => [
          'ru' => 'Свято-Успенская<br> Киево-Печерская Лавра',
          'uk' => 'Свято-Успенська<br> Києво-Печерська Лавра',
        ],
        'text' => [
          'ru' => 'Киево-Печерская Лавра — древнейший монастырь в Украине. В её стенах работает возрождённая в 1989 году Киевская духовная семинария, а с 1992 года Киевская духовная академия. Братия монастыря регулярно совершает богослужения в Трапезном храме Преподобных Антония и Феодосия Печерских в главном храме обители — Успенском соборе.',
          'uk' => 'Києво-Печерська Лавра — найдавніший монастир в України. В її стінах працює відроджена в 1989 році Київська духовна семінарія, а з 1992 року —  Київська духовна академія. Братія монастиря регулярно здійснює богослужіння в Трапезному храмі Преподобних Антонія і Феодосія Печерських в головному храмі обителі — Успенському соборі.',
        ],
      ],
      '3' => [
        'title' => [
          'ru' => 'Кафедральный собор Богоявления Господнего',
          'uk' => 'Кафедральний собор Богоявлення Господнього',
        ],
        'text' => [
          'ru' => 'Православный кафедральный собор в Горловке. Первый камень был заложен 4 июля 2007 года. Собор освящён Блаженнейшим Владимиром, Митрополитом Киевским и всея Украины 18 сентября 2013 года.',
          'uk' => 'Православний кафедральний собор в Горлівці. Перший камінь був закладений 4 липня 2007 року. Собор освячений Блаженнішим Володимиром, Митрополитом Київським і всієї України 18 вересня 2013 року.',
        ],
      ],
      '4' => [
        'title' => [
          'ru' => 'Больше 10 других соборов и храмов в Украине и за рубежом',
          'uk' => 'Більше 10 інших соборів і храмів в Україні та за кордоном',
        ],
        'text' => [
          'ru' => 'Свято-Николаевский храм Киевской Епархии, Свято-Успенский Собор и Свято-Николаевский храм Днепропетровской епархии. Свято-Георгиевская община и Свято-Троицкий собор Донецкой епархии. Свято-Сергиевский женский монастырь Горловской епархии и другие.
',
          'uk' => 'Свято-Миколаївський храм Київської Єпархії, Свято-Успенський Собор і Свято-Миколаївський храм Дніпропетровської єпархії. Свято-Георгіївська громада і Свято-Троїцький собор Донецької єпархії. Свято-Сергієвський жіночий монастир Горлівської єпархії та інші.
',
        ],
      ],
    ]
  ];

  /*** Founders translations ***/
  $languages['founders'] = [
    'title' => [
      'ru' => 'Основатели фонда',
      'uk' => 'Засновники фонду',
    ],
    'text' => [
      'ru' => 'Этот сайт создан, чтобы вы могли найти нас, если вам понадобится помощь.<br>Мы не будем публиковать отчётов о проделанной работе и фотографии благодарных подопечных. Мы – православные христиане и помним евангельские слова «когда творишь милостыню, не труби перед собою… пусть левая рука твоя не знает, что делает правая, чтобы милостыня твоя была втайне; и Отец твой, видящий тайное, воздаст тебе явно» (Мф. 6:2–4).<br>Мы убеждены, что по-настоящему мир можно изменить только добром и любовью, которые стали стилем жизни. И мы стараемся сделать мир лучше.',
      'uk' => "Цей сайт створений, щоб ви змогли знайти нас, якщо вам знадобиться допомога.<br>Ми не будемо публікувати звітів про виконану роботу і фото вдячних підопічних. Ми — православні християни і пам'ятаємо біблейські слова: «коли твориш милостиню, не сурми перед собою ... нехай ліва рука твоя не знає, що робить права, щоб таємна була твоя милостиня; і Отець твій, що бачить таємне, віддасть тобі явно» (Мф. 6: 2–4).<br>Ми переконані, що по-справжньому світ можна змінити тільки добром і любов'ю, які стали стилем життя. І ми намагаємося зробити світ кращим.",
    ],
    'name' => [
      'ru' => 'Клименко<br> Антон Викторович',
      'uk' => 'Клименко<br> Антон Вікторович',
    ],
    'description' => [
      'ru' => 'Бизнесмен, политик,<br> венчурный инвестор,<br> филантроп',
      'uk' => 'Бізнесмен, політик,<br> венчурний інвестор,<br> філантроп ',
    ],
  ];

  /*** Modal translations ***/
  $languages['modal'] = [
    'text' => [
      'ru' => [
        'В начале 2000-х мы посетили детское отделение туберкулезной больницы. И ужаснулись. Ребята лечились там годами, спали на сбившихся в комки подушках и матрасах. В палатах было темно и сыро. Не задумываясь мы организовали небольшой ремонт, купили новое постельные бельё и лампочки. Но детей это мало порадовало…',
         'Тогда работница больницы дала нам совет: «Одеяла и подушки – это хорошо, но детям нужен праздник!». Мы прислушались к её словам. Стали регулярно организовывать день именинника, со сладостями, воздушными шарами, конкурсами и подарками. Фотографии с этих замечательных дней рождений мы храним до сих пор. Так и началась наша благотворительная деятельность.',
         'Мы помогаем совсем маленьким детям до трёх лет — отказникам, часто тяжело больным. Ребятам постарше содействуем в преодолении серьезных недугов. Сегодня счёт таких детей идет уже на сотни.',
         'Наш фонд оказывает благотворительную помощь всем нуждающимся независимо от национальности, гражданства и социального положения.'
      ],
      'uk' => [
        'На початку 2000-х ми відвідали дитяче відділення туберкульозної лікарні. Це було сумне видовище. Діти лікувалися там роками, спали на старих подушках і матрацах. В палатах було темно й сиро. Не замислюючись ми зробили невеликий ремонт, купили нову постільну білизну й лампочки. Але дітей це мало порадувало…',
         'Тоді працівниця лікарні дала нам пораду: «Ковдри і подушки — це добре, але ж дітям потрібне свято!». Ми прислухалися до її слів. Стали організовувати день іменинника з солодощами, повітряними кульками, конкурсами і подарунками. Фотографії з тих чудових днів народжень зберігаємо й досі. Так і почалася наша благодійна діяльність.',
         'Ми допомагаємо малечі до трьох років, від яких відмовилися батьки, часто важко хворим. Дорослішим дітям допомагаємо в подоланні серйозних хвороб. Сьогодні рахунок таких дітей йде вже на сотні.',
         'Сьогодні наш фонд надає благодійну допомогу всім нужденним незалежно від національності, громадянства та соціального становища.'
      ],
    ],
  ];

?>